#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_key_pair.deployer: Refreshing state... [id=deployer-key-ec2]
aws_security_group.ec2_SG: Refreshing state... [id=sg-058292d9e4ae38580]
aws_instance.ec2_instance: Refreshing state... [id=i-022acb453a0e24711]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_instance.ec2_instance has been deleted
  - resource "aws_instance" "ec2_instance" {
      - id                                   = "i-022acb453a0e24711" -> null
        tags                                 = {
            "Name"         = "HybridHavenAPI"
            "createdusing" = "Terraform"
            "owner"        = "Umang.Vadadoriya@bbd.co.za"
        }
        # (33 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_key_pair.deployer has been deleted
  - resource "aws_key_pair" "deployer" {
        id          = "deployer-key-ec2"
      - key_name    = "deployer-key-ec2" -> null
        tags        = {
            "createdusing" = "Terraform"
            "owner"        = "Umang.Vadadoriya@bbd.co.za"
        }
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.ec2_instance will be created
  + resource "aws_instance" "ec2_instance" {
      + ami                                  = "ami-0fc3317b37c1269d3"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "deployer-key-ec2"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"         = "HybridHavenAPI"
          + "createdusing" = "Terraform"
          + "owner"        = "Umang.Vadadoriya@bbd.co.za"
        }
      + tags_all                             = {
          + "Name"         = "HybridHavenAPI"
          + "createdusing" = "Terraform"
          + "owner"        = "Umang.Vadadoriya@bbd.co.za"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "ff65e0395b6df4153bb51f27a69f45d6e2cbf05e"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-058292d9e4ae38580",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_key_pair.deployer will be created
  + resource "aws_key_pair" "deployer" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "deployer-key-ec2"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDRIJZ49qaeLPM0WGiYGYbzKakJQgTXez7G/NKF0+xqPmUXPfHJ9BTtq6MfJEQGx13aQnMRTjhS/Tys3hgzz69iFaSFVhCfXf+II6ZCshNBRbf/LTYli5QzustIBpL+xUF3MNNjJV7mykDGJ7sryrhpkQbJzglO+puVb+81nwCyT4igv2jKqPA9Z6YVSt5aU/JOIDb6N2rbq6NsgLT6l/LsS+rm1AsaQw7RnQMqoHIroduQpviQsr20bQQZlsO2cS+LO7QcbqC3toggQNkhmwHJf41DdOQl1IzvmMtJMF6WJooRZloeSo/9DeprN9lG9Ues1/uLQB56gnrvkZyHx6eHquYVJmVLBk0+vonESA2AKgMsdzR2oaY/zzsd6cXr4foMmtPEDbulZvNlhfcGIVGoU0BjgHiKplfJ9kWvmEo3HgLsKQ19UeKldmKb5038wGylHQ9jcE2cxFBSvBHUkQ+tmuYXJtvFv5JgJA41QOFYS/ZgR119P4BSNNX0PfBT4sc= ec2-user"
      + tags            = {
          + "createdusing" = "Terraform"
          + "owner"        = "Umang.Vadadoriya@bbd.co.za"
        }
      + tags_all        = {
          + "createdusing" = "Terraform"
          + "owner"        = "Umang.Vadadoriya@bbd.co.za"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ ec2_instance_id = "i-022acb453a0e24711" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Umang-Vadadoriya-BBD, Action: `pull_request`*